JohnDevine/ESP32-MQTT-Template/src/main.c
/*
 * ESP32 MQTT TEMPLATE PROJECT
 * 
 * This is a template version of the ESP32MQTTBase project. It has been modified
 * to remove specific BMS (Battery Management System) code and replace it with
 * generic placeholders for easy customization.
 * 
 * TEMPLATE PLACEHOLDERS:
 * - Search for "PutInputCodeHere" to find places where you should add your
 *   specific input reading, parsing, and communication code.
 * - Search for "PutOutputFormattingForMqttHere" to find places where you should
 *   customize the MQTT output formatting for your data structure.
 * 
 * RETAINED FEATURES:
 * - WiFi configuration with captive portal
 * - MQTT connectivity with reconnection handling
 * - Web-based configuration interface
 * - OTA (Over-The-Air) firmware updates
 * - System monitoring and watchdog functionality
 * - Persistent configuration storage (NVS)
 * 
 * TO USE THIS TEMPLATE:
 * 1. Replace input_data_t struct with your data structure
 * 2. Implement your communication protocol and data reading logic
 * 3. Customize the MQTT JSON output format
 * 4. Update default configuration values as needed
 * 5. Test with your specific hardware and data sources
 */

/*
 * CONDITIONAL LOGGING CONFIGURATION
 * 
 * To enable debug logging for this specific file, uncomment the line below.
 * This allows ESP_LOGD() calls to be compiled in and displayed when the 
 * global log level is set to DEBUG or VERBOSE.
 * 
 * Log Levels (from highest to lowest priority):
 * - ESP_LOG_ERROR   (E) - Error conditions
 * - ESP_LOG_WARN    (W) - Warning conditions  
 * - ESP_LOG_INFO    (I) - Informational messages
 * - ESP_LOG_DEBUG   (D) - Debug messages
 * - ESP_LOG_VERBOSE (V) - Verbose debug messages
 * 
 * To set global log level in menuconfig:
 * Component config > Log output > Default log verbosity
 * 
 * To set at runtime: esp_log_level_set("*", ESP_LOG_DEBUG);
 */
// #define LOG_LOCAL_LEVEL ESP_LOG_DEBUG

// Standard C input/output library
#include <stdio.h>
// FreeRTOS real-time operating system definitions
#include "freertos/FreeRTOS.h"
// FreeRTOS task management
#include "freertos/task.h"
// ESP32 UART driver
#include "driver/uart.h"
// ESP32 GPIO driver
#include "driver/gpio.h"
// ESP-IDF logging library
#include "esp_log.h"
// Standard C string manipulation library (for memcmp)
#include <string.h> 

// Added for Wi-Fi and MQTT
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "mqtt_client.h"
#include "cJSON.h" // For JSON formatting
#include "esp_spiffs.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_http_server.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include <errno.h>
#include "esp_chip_info.h"
#include "esp_ota_ops.h"
#include "esp_flash.h"
#include "spi_flash_mmap.h"
#include "esp_partition.h"
#include "esp_http_server.h"

// Watchdog timer includes
#include "esp_task_wdt.h"

// System monitoring includes
#include "esp_netif.h"

// Software watchdog variables
static uint32_t watchdog_timeout_ms = 0;  // Watchdog timeout (10× sample interval)
static TickType_t last_successful_publish = 0;  // Last successful MQTT publish time
static bool watchdog_enabled = false;  // Whether watchdog is enabled
static bool mqtt_publish_success = false;  // Flag for successful MQTT publish

// Debug logging flag - set to false to reduce log output (except watchdog logs)
static bool debug_logging = false;

#define WIFI_NVS_NAMESPACE "wifi_cfg"
#define WIFI_NVS_KEY_SSID "ssid"
#define WIFI_NVS_KEY_PASS "pass"
#define MQTT_NVS_KEY_URL "broker_url"
#define NVS_KEY_SAMPLE_INTERVAL "sample_interval"
#define NVS_KEY_DATA_TOPIC "data_topic"
#define NVS_KEY_WATCHDOG_COUNTER "watchdog_cnt"
#define NVS_KEY_PACK_NAME "pack_name"
#define DEFAULT_WIFI_SSID "yourSSID"
#define DEFAULT_WIFI_PASS "yourpassword"
#define DEFAULT_MQTT_BROKER_URL "mqtt://192.168.1.100"
#define DEFAULT_SAMPLE_INTERVAL 5000L
#define DEFAULT_PACK_NAME "Set in Parameters"

static char wifi_ssid[33] = DEFAULT_WIFI_SSID;
static char wifi_pass[65] = DEFAULT_WIFI_PASS;
static char mqtt_broker_url[128] = DEFAULT_MQTT_BROKER_URL;
char data_topic[41] = "Data/Template";  // Remove static to make it globally accessible
static long sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
static uint32_t watchdog_reset_counter = 0;  // Watchdog timer reset counter
static char pack_name[64] = DEFAULT_PACK_NAME;  // Pack name field

// Define the UART peripheral number to be used (UART2 in this case)
#define UART_NUM UART_NUM_2
// Define the GPIO pin for UART Transmit (TX)
#define UART_TX_PIN GPIO_NUM_17
// Define the GPIO pin for UART Receive (RX)
#define UART_RX_PIN GPIO_NUM_16
#define BOOT_BTN_GPIO GPIO_NUM_0
// Define the size of the UART buffer for receiving data
#define UART_BUF_SIZE 1024

// Tag used for logging messages from this module
static const char *TAG = "DATA_READER";

// Wi-Fi Configuration
#define EXAMPLE_ESP_MAXIMUM_RETRY  5

// MQTT Configuration
#define MQTT_BROKER_URL "mqtt://192.168.1.5"
#define MQTT_TOPIC_PACK "NodeJKBMS2/pack"
#define MQTT_TOPIC_CELLS "NodeJKBMS2/cells"

// Global variable for MQTT client
static esp_mqtt_client_handle_t mqtt_client;
static int wifi_retry_num = 0;

// Template data structure for input data
// Replace this with your specific data structure
typedef struct {
    // PutInputCodeHere: Define your data structure fields here
    // Example fields (replace with your actual data fields):
    float example_voltage;
    float example_current;
    uint8_t example_percentage;
    // Add your specific data fields here
} input_data_t;

// Global instance of input data
static input_data_t current_input_data;


// PutInputCodeHere: Define your protocol-specific data structures here
// Example: If you need to store parsed fields from your input data
// typedef struct {
//     uint8_t id;
//     uint32_t value;
//     char strval[48];
//     int is_ascii;
// } parsed_field_t;
// #define MAX_PARSED_FIELDS 32
// static parsed_field_t parsed_fields[MAX_PARSED_FIELDS];
// static int parsed_fields_count = 0;

