JohnDevine/ESP32-MQTT-Template/src/main.c
// Forward declarations for functions defined later in this file

// Forward declarations for NVS functions
static void load_watchdog_counter_from_nvs(void);
static void save_watchdog_counter_to_nvs(void);
static void load_pack_name_from_nvs(void);

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

void url_decode(char *dst, const char *src, size_t dstsize);

// Forward declarations for HTTP handlers
static esp_err_t params_json_get_handler(httpd_req_t *req);
static esp_err_t params_update_post_handler(httpd_req_t *req);
static esp_err_t parameters_html_handler(httpd_req_t *req);
static esp_err_t captive_redirect_handler(httpd_req_t *req);
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req);
static esp_err_t ota_firmware_handler(httpd_req_t *req);
static esp_err_t ota_filesystem_handler(httpd_req_t *req);

// Initializes the UART communication peripheral.
void init_uart();
// Sends a command to the device via UART.
void send_device_command(const uint8_t* cmd, size_t len);
// Reads data from the BMS via UART. This function is static, meaning it's only visible within this file.
static void read_bms_data(); 
// Template function to parse input data
// PutInputCodeHere: Replace this function with your specific data parsing logic
void parse_input_data(const uint8_t *data, int len);

// New forward declarations for Wi-Fi and MQTT
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data);
static void mqtt_event_handler(void* arg, esp_event_base_t event_base,
                               int32_t event_id, void* event_data);
void wifi_init_sta(void);
static void mqtt_app_start(void);
void publish_input_data_mqtt(const input_data_t *input_data_ptr); // Template publish function

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

// Constant array holding the "Read All Data" command bytes to be sent to the JK BMS.
// This command requests a comprehensive status update from the BMS.
// Template constants and commands
// PutInputCodeHere: Define your protocol constants here
// Examples:
// const uint8_t your_read_command[] = {0x01, 0x02, 0x03, 0x04};
// const uint8_t your_config_command[] = {0x05, 0x06, 0x07, 0x08};

// Template command example (replace with your actual command)
const uint8_t template_read_cmd[] = {
    0xAA, 0x55,           // Start bytes (example)
    0x01,                 // Command ID (example)
    0x00,                 // Data length (example)
    0xBB                  // End byte (example)
};

// Helper function to extract a 16-bit unsigned integer from a buffer.
// Assumes big-endian byte order (most significant byte first).
// buffer: Pointer to the byte array.
// offset: Starting index in the buffer from where to read the 16-bit integer.
// Returns the extracted 16-bit unsigned integer.
uint16_t unpack_u16_be(const uint8_t *buffer, int offset) {
    // Combine two consecutive bytes into a 16-bit value.
    // buffer[offset] is the most significant byte, buffer[offset+1] is the least significant.
    return ((uint16_t)buffer[offset] << 8) | buffer[offset + 1];
}

// Helper function to extract an 8-bit unsigned integer (a single byte) from a buffer.
// buffer: Pointer to the byte array.
// offset: Index in the buffer from where to read the 8-bit integer.
// Returns the extracted 8-bit unsigned integer.
uint8_t unpack_u8(const uint8_t *buffer, int offset) {
    // Directly return the byte at the specified offset.
    return buffer[offset];
}

// Initializes the UART peripheral for communication with the BMS.
void init_uart() {
    // UART configuration structure
    uart_config_t uart_config = {
        .baud_rate = 115200,                // Baud rate for serial communication
        .data_bits = UART_DATA_8_BITS,      // 8 data bits per frame
        .parity    = UART_PARITY_DISABLE,   // No parity bit
        .stop_bits = UART_STOP_BITS_1,      // 1 stop bit
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE, // No hardware flow control
        .source_clk = UART_SCLK_APB,        // Clock source for UART (APB clock)
    };
    // Install UART driver, and get the queue.
    // UART_NUM: UART port number
    // UART_BUF_SIZE * 2: RX buffer size (doubled for safety)
    // 0: TX buffer size (0 means driver will not allocate TX buffer, direct write)
    // 0, NULL: No event queue
    // 0: Interrupt allocation flags
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM, UART_BUF_SIZE * 2, 0, 0, NULL, 0));
    // Configure UART parameters
    ESP_ERROR_CHECK(uart_param_config(UART_NUM, &uart_config));
    // Set UART pins for TX, RX, RTS, CTS
    // UART_TX_PIN: TX pin number
    // UART_RX_PIN: RX pin number
    // UART_PIN_NO_CHANGE: RTS pin (not used)
    // UART_PIN_NO_CHANGE: CTS pin (not used)
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM, UART_TX_PIN, UART_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
    ESP_LOGI(TAG, "UART initialized");
}

// Sends a command (array of bytes) to the device via UART.
// cmd: Pointer to the byte array containing the command.
// len: Length of the command in bytes.
void send_device_command(const uint8_t* cmd, size_t len) {
    // Write data to UART.
    // (const char*)cmd: Cast command buffer to char pointer as expected by the function.
    int txBytes = uart_write_bytes(UART_NUM, (const char*)cmd, len);
    ESP_LOGI(TAG, "Wrote %d bytes", txBytes); // Log the number of bytes written.
}

// Parses the raw data received from the BMS and prints it.
// data: Pointer to the buffer containing the raw data from BMS.
// len: Length of the data in bytes.
// Template function to parse input data  
// PutInputCodeHere: Replace this function with your specific data parsing logic
void parse_input_data(const uint8_t *data, int len) {
    ESP_LOGI(TAG, "Parsing input data (%d bytes)...", len);
    
    // PutInputCodeHere: Add your specific data parsing code here
    // Examples:
    // - Parse protocol frames (like Modbus, CAN, etc.)
    // - Validate checksums
    // - Extract specific data fields
    // - Convert raw values to meaningful units
    // - Perform data validation
    // - etc.
    
    // Example placeholder parsing (replace with actual parsing logic):
    if (len >= 4) {
        // Example: Parse first 4 bytes as different data types
        current_input_data.example_voltage = (float)((data[0] << 8) | data[1]) / 100.0f;  // Convert to voltage
        current_input_data.example_current = (float)((data[2] << 8) | data[3]) / 100.0f;  // Convert to current  
        current_input_data.example_percentage = len > 4 ? data[4] : 50;  // Use 5th byte if available
        
        ESP_LOGI(TAG, "Parsed values - Voltage: %.2fV, Current: %.2fA, Percentage: %d%%", 
                 current_input_data.example_voltage, current_input_data.example_current, current_input_data.example_percentage);
    } else {
        ESP_LOGW(TAG, "Insufficient data for parsing (%d bytes)", len);
        return;
    }
    
