JohnDevine/ESP32-MQTT-Template/src/main.c
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        esp_err_t set_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
        ESP_LOGI(TAG, "NVS set_u32 result: %s", esp_err_to_name(set_err));
        if (set_err == ESP_OK) {
            nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for saving watchdog counter: %s", esp_err_to_name(err));
    }
}

void load_pack_name_from_nvs() {
    ESP_LOGI(TAG, "=== LOADING PACK NAME FROM NVS ===");
    ESP_LOGI(TAG, "Initial pack_name value: '%s'", pack_name);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    ESP_LOGI(TAG, "NVS open result: %s", esp_err_to_name(err));
    
    if (err == ESP_OK) {
        size_t name_len = sizeof(pack_name);
        ESP_LOGI(TAG, "Attempting to read NVS key '%s', buffer size: %d", NVS_KEY_PACK_NAME, name_len);
        
        esp_err_t get_err = nvs_get_str(nvs_handle, NVS_KEY_PACK_NAME, pack_name, &name_len);
        ESP_LOGI(TAG, "NVS get_str result: %s", esp_err_to_name(get_err));
        
        if (get_err != ESP_OK) {
            ESP_LOGW(TAG, "Pack name not found in NVS (error: %s), using default: %s", esp_err_to_name(get_err), DEFAULT_PACK_NAME);
            strncpy(pack_name, DEFAULT_PACK_NAME, sizeof(pack_name)-1);
            pack_name[sizeof(pack_name)-1] = '\0';
            esp_err_t set_err = nvs_set_str(nvs_handle, NVS_KEY_PACK_NAME, pack_name);
            ESP_LOGI(TAG, "Default pack name save result: %s", esp_err_to_name(set_err));
            nvs_commit(nvs_handle);
        } else {
            ESP_LOGI(TAG, "Successfully loaded pack name from NVS: '%s' (length: %d)", pack_name, name_len);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for pack name: %s", esp_err_to_name(err));
        strncpy(pack_name, DEFAULT_PACK_NAME, sizeof(pack_name)-1);
        pack_name[sizeof(pack_name)-1] = '\0';
    }
    ESP_LOGI(TAG, "=== FINAL PACK NAME: '%s' ===", pack_name);
}

void save_pack_name_to_nvs(const char *name) {
    ESP_LOGI(TAG, "=== SAVING PACK NAME TO NVS ===");
    ESP_LOGI(TAG, "Saving pack_name: '%s'", name);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        esp_err_t set_err = nvs_set_str(nvs_handle, NVS_KEY_PACK_NAME, name);
        ESP_LOGI(TAG, "NVS set_str result: %s", esp_err_to_name(set_err));
        if (set_err == ESP_OK) {
            nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for saving pack name: %s", esp_err_to_name(err));
    }
}

// SPIFFS init
void init_spiffs() {
    ESP_LOGI(TAG, "Initializing SPIFFS...");
    esp_vfs_spiffs_conf_t conf = {
        .base_path = "/spiffs",
        .partition_label = NULL,
        .max_files = 5,
        .format_if_mount_failed = true
    };
    
    ESP_ERROR_CHECK(esp_vfs_spiffs_register(&conf));
    
    size_t total = 0, used = 0;
    esp_err_t ret = esp_spiffs_info(NULL, &total, &used);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
    } else {
        ESP_LOGI(TAG, "SPIFFS: %d kB total, %d kB used", total / 1024, used / 1024);
    }
}

// HTTP handler for /params.json
esp_err_t params_json_get_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== PARAMS.JSON REQUEST ===");
    
    // Debug: Show counter before reloading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before reload: %lu ***", watchdog_reset_counter);
    
    // Reload watchdog counter from NVS to ensure latest value is displayed
    load_watchdog_counter_from_nvs();
    
    // Debug: Show counter after reloading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after reload: %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "Current data_topic variable: '%s'", data_topic);
    ESP_LOGI(TAG, "Current wifi_ssid: '%s'", wifi_ssid);
    ESP_LOGI(TAG, "Current mqtt_broker_url: '%s'", mqtt_broker_url);
    ESP_LOGI(TAG, "Current sample_interval_ms: %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Current watchdog_reset_counter: %lu", watchdog_reset_counter);
    ESP_LOGI(TAG, "Current pack_name: '%s'", pack_name);
    
    char buf[512];
    snprintf(buf, sizeof(buf), "{\"ssid\":\"%s\",\"password\":\"%s\",\"mqtt_url\":\"%s\",\"sample_interval\":%ld,\"data_topic\":\"%s\",\"watchdog_reset_counter\":%lu,\"pack_name\":\"%s\"}", 
             wifi_ssid, wifi_pass, mqtt_broker_url, sample_interval_ms, data_topic, watchdog_reset_counter, pack_name);
    ESP_LOGI(TAG, "Sending params.json response: %s", buf);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, buf, HTTPD_RESP_USE_STRLEN);
    ESP_LOGI(TAG, "=== PARAMS.JSON RESPONSE SENT ===");
    return ESP_OK;
}

// Global flag to signal shutdown
static bool system_shutting_down = false;

// Reboot task function
static void reboot_task(void *param) {
    ESP_LOGI(TAG, "Reboot task started, shutting down gracefully...");
    
    // Set shutdown flag to signal other tasks to stop
    system_shutting_down = true;
    
    // Give time for HTTP response to complete
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Disabling task watchdog before restart...");
    esp_task_wdt_deinit();
    
    // Give a bit more time for tasks to see the shutdown flag
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Performing system restart NOW...");
    fflush(stdout);  // Ensure log message is sent
    
    esp_restart();
    
    // This line should never be reached
    vTaskDelete(NULL);
}

// HTTP handler for /update (POST)
esp_err_t params_update_post_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== UPDATE REQUEST RECEIVED ===");
    
    char buf[512];
    int ret = httpd_req_recv(req, buf, sizeof(buf)-1);
    if (ret <= 0) {
        ESP_LOGE(TAG, "Failed to receive update data");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    buf[ret] = 0;
    
    ESP_LOGI(TAG, "Received update data: %s", buf);
    
