JohnDevine/ESP32-MQTT-Template/src/main.c
    char ssid[33] = "", pass[65] = "", mqtt_url[128] = "";
    long interval = 5000;
    sscanf(strstr(buf, "ssid=")+5, "%32[^&]", ssid);
    sscanf(strstr(buf, "password=")+9, "%64[^&]", pass);
    sscanf(strstr(buf, "mqtt_url=")+9, "%127[^&]", mqtt_url);
    sscanf(strstr(buf, "sample_interval=")+16, "%ld", &interval);
    // Decode URL-encoded values
    char ssid_dec[33], pass_dec[65], url_dec[128];
    url_decode(ssid_dec, ssid, sizeof(ssid_dec));
    url_decode(pass_dec, pass, sizeof(pass_dec));
    url_decode(url_dec, mqtt_url, sizeof(url_dec));
    strncpy(wifi_ssid, ssid_dec, sizeof(wifi_ssid)-1);
    strncpy(wifi_pass, pass_dec, sizeof(wifi_pass)-1);
    strncpy(mqtt_broker_url, url_dec, sizeof(mqtt_broker_url)-1);
    sample_interval_ms = interval;
    // Save to NVS
    nvs_handle_t nvs_handle;
    nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass);
    nvs_set_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url);
    nvs_set_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, (int64_t)sample_interval_ms);
    // Handle Data topic
    ESP_LOGI(TAG, "=== PROCESSING BMS TOPIC ===");
    ESP_LOGI(TAG, "Current data_topic before update: '%s'", data_topic);
    
    char data_topic_in[41] = "";
    char data_topic_dec[41];
    char *data_topic_ptr = strstr(buf, "data_topic=");
    if (data_topic_ptr) {
        sscanf(data_topic_ptr + 10, "%40[^&]", data_topic_in);
        ESP_LOGI(TAG, "Raw Data topic from form: '%s'", data_topic_in);
        
        url_decode(data_topic_dec, data_topic_in, sizeof(data_topic_dec));
        ESP_LOGI(TAG, "URL decoded Data topic: '%s'", data_topic_dec);
        
        strncpy(data_topic, data_topic_dec, sizeof(data_topic)-1);
        data_topic[sizeof(data_topic)-1] = '\0';
        ESP_LOGI(TAG, "Data topic updated to: '%s'", data_topic);
    } else {
        ESP_LOGW(TAG, "No data_topic found in request data: %s", buf);
    }
    
    esp_err_t nvs_err = nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic);
    ESP_LOGI(TAG, "Saved Data topic '%s' to NVS with key '%s': %s", data_topic, NVS_KEY_DATA_TOPIC, esp_err_to_name(nvs_err));
    ESP_LOGI(TAG, "=== BMS TOPIC PROCESSING COMPLETE ===");
    
    // Handle Pack Name
    ESP_LOGI(TAG, "=== PROCESSING PACK NAME ===");
    ESP_LOGI(TAG, "Current pack_name before update: '%s'", pack_name);
    
    char pack_name_in[64] = "";
    char pack_name_dec[64];
    char *pack_name_ptr = strstr(buf, "pack_name=");
    if (pack_name_ptr) {
        sscanf(pack_name_ptr + 10, "%63[^&]", pack_name_in);
        ESP_LOGI(TAG, "Raw pack name from form: '%s'", pack_name_in);
        
        url_decode(pack_name_dec, pack_name_in, sizeof(pack_name_dec));
        ESP_LOGI(TAG, "URL decoded pack name: '%s'", pack_name_dec);
        
        strncpy(pack_name, pack_name_dec, sizeof(pack_name)-1);
        pack_name[sizeof(pack_name)-1] = '\0';
        ESP_LOGI(TAG, "Pack name updated to: '%s'", pack_name);
    } else {
        ESP_LOGW(TAG, "No pack_name found in request data: %s", buf);
    }
    
    esp_err_t pack_name_nvs_err = nvs_set_str(nvs_handle, NVS_KEY_PACK_NAME, pack_name);
    ESP_LOGI(TAG, "Saved pack name '%s' to NVS with key '%s': %s", pack_name, NVS_KEY_PACK_NAME, esp_err_to_name(pack_name_nvs_err));
    ESP_LOGI(TAG, "=== PACK NAME PROCESSING COMPLETE ===");
    
    // Handle Watchdog Reset Counter
    ESP_LOGI(TAG, "=== PROCESSING WATCHDOG RESET COUNTER ===");
    ESP_LOGI(TAG, "Current watchdog_reset_counter before update: %lu", watchdog_reset_counter);
    
    char *watchdog_counter_ptr = strstr(buf, "watchdog_reset_counter=");
    if (watchdog_counter_ptr) {
        uint32_t counter_value = 0;
        sscanf(watchdog_counter_ptr + 23, "%lu", &counter_value);
        ESP_LOGI(TAG, "Watchdog counter from form: %lu", counter_value);
        
        watchdog_reset_counter = counter_value;
        ESP_LOGI(TAG, "Watchdog reset counter updated to: %lu", watchdog_reset_counter);
    } else {
        ESP_LOGW(TAG, "No watchdog_reset_counter found in request data: %s", buf);
    }
    
    esp_err_t watchdog_nvs_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
    ESP_LOGI(TAG, "Saved watchdog counter %lu to NVS with key '%s': %s", watchdog_reset_counter, NVS_KEY_WATCHDOG_COUNTER, esp_err_to_name(watchdog_nvs_err));
    ESP_LOGI(TAG, "=== WATCHDOG RESET COUNTER PROCESSING COMPLETE ===");
    
    nvs_commit(nvs_handle);
    nvs_close(nvs_handle);
    
    ESP_LOGI(TAG, "Configuration saved successfully. Sending response...");
    httpd_resp_sendstr(req, "Saved. Rebooting...");
    
    ESP_LOGI(TAG, "Response sent. Starting reboot sequence...");
    // Give the HTTP response time to be sent
    vTaskDelay(500 / portTICK_PERIOD_MS);
    
    // Schedule reboot in a separate task to avoid blocking the HTTP response
    ESP_LOGI(TAG, "Creating reboot task...");
    BaseType_t task_created = xTaskCreate(reboot_task, "reboot_task", 2048, NULL, 1, NULL);
    if (task_created == pdPASS) {
        ESP_LOGI(TAG, "Reboot task created successfully");
    } else {
        ESP_LOGE(TAG, "Failed to create reboot task");
    }
    
    return ESP_OK;
}

// HTTP handler for /parameters.html
esp_err_t parameters_html_handler(httpd_req_t *req) {
    FILE *f = fopen("/spiffs/parameters.html", "r");
    if (!f) {
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
    char buf[512];
    httpd_resp_set_type(req, "text/html");
    size_t n;
    while ((n = fread(buf, 1, sizeof(buf), f)) > 0) {
        httpd_resp_send_chunk(req, buf, n);
    }
    fclose(f);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

// Captive portal redirect handler
esp_err_t captive_redirect_handler(httpd_req_t *req) {
    ESP_LOGD(TAG, "Captive portal request: %s", req->uri);
    
    // If the request is already for /parameters.html, serve it directly
    if (strcmp(req->uri, "/parameters.html") == 0) {
        return parameters_html_handler(req);
    }
    
    // Check for other valid endpoints and serve them directly
    if (strcmp(req->uri, "/params.json") == 0) {
        return params_json_get_handler(req);
    }
    if (strcmp(req->uri, "/sysinfo.json") == 0) {
        return sysinfo_json_get_handler(req);
    }
    if (strcmp(req->uri, "/update") == 0) {
        return params_update_post_handler(req);
    }
    
    // For any other request, redirect to the configuration page
    ESP_LOGD(TAG, "Redirecting %s to /parameters.html", req->uri);
    
    const char* redirect_html = 
        "<!DOCTYPE html>\n"
        "<html>\n"
        "<head>\n"
        "<meta charset=\"UTF-8\">\n"
        "<title>ESP32 Configuration</title>\n"
        "<meta http-equiv=\"refresh\" content=\"0; url=/parameters.html\">\n"
        "</head>\n"
        "<body>\n"
        "<p>Redirecting to configuration page...</p>\n"
        "<p>If you are not redirected automatically, <a href=\"/parameters.html\">click here</a>.</p>\n"
        "</body>\n"
        "</html>";
    
    httpd_resp_set_status(req, "200 OK");
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_set_hdr(req, "Expires", "0");
    httpd_resp_send(req, redirect_html, strlen(redirect_html));
    
    return ESP_OK;
}

// Handler for /sysinfo.json
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req) {
    char resp[512];
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    // Use esp_app_get_description if available, else fallback
    #if ESP_IDF_VERSION_MAJOR >= 5
    const esp_app_desc_t *app_desc = esp_app_get_description();
    #else
    const esp_app_desc_t *app_desc = esp_ota_get_app_description();
    #endif
    const char *idf_ver = esp_get_idf_version();
    
    // Read version from version.txt file in SPIFFS
    // Note: This file (data/version.txt) must be kept in sync with the master 
    // version file (version.txt in project root). The master file serves as 
    // the source of truth, while this file is deployed to the ESP32 for 
    // runtime display in the web interface.
    char version_str[16] = "1.3.0"; // Default fallback - update when master version changes
    FILE *version_file = fopen("/spiffs/version.txt", "r");
    if (version_file) {
        if (fgets(version_str, sizeof(version_str), version_file)) {
            // Remove trailing newline if present
            char *newline = strchr(version_str, '\n');
            if (newline) *newline = '\0';
            char *carriage_return = strchr(version_str, '\r');
            if (carriage_return) *carriage_return = '\0';
        }
        fclose(version_file);
    }
    
    esp_reset_reason_t reason = esp_reset_reason();
    const char *reason_str = "Unknown";
    switch (reason) {
        case ESP_RST_POWERON: reason_str = "Power-on"; break;
        case ESP_RST_EXT: reason_str = "External"; break;
        case ESP_RST_SW: reason_str = "Software"; break;
        case ESP_RST_PANIC: reason_str = "Panic"; break;
        case ESP_RST_INT_WDT: reason_str = "Interrupt WDT"; break;
        case ESP_RST_TASK_WDT: reason_str = "Task WDT"; break;
        case ESP_RST_WDT: reason_str = "Other WDT"; break;
        case ESP_RST_DEEPSLEEP: reason_str = "Deep Sleep"; break;
        case ESP_RST_BROWNOUT: reason_str = "Brownout"; break;
        case ESP_RST_SDIO: reason_str = "SDIO"; break;
        default: break;
    }
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char chip_id[18];
    snprintf(chip_id, sizeof(chip_id), "%02X%02X%02X%02X%02X%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    // Get flash chip information
    uint32_t flash_id = 0x000000; // Placeholder
    uint32_t flash_size = 0;
    
    // Get actual flash size - ESP32 DevKit V1 typically has 4MB
    // Use the more reliable method of checking all partitions to estimate total flash
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    uint32_t max_offset = 0;
    while (it != NULL) {
        const esp_partition_t *partition = esp_partition_get(it);
        uint32_t partition_end = partition->address + partition->size;
        if (partition_end > max_offset) {
            max_offset = partition_end;
        }
        it = esp_partition_next(it);
    }
    if (it) esp_partition_iterator_release(it);
    
    // Round up to nearest MB and ensure it's at least 4MB for ESP32 DevKit V1
    if (max_offset > 0) {
        flash_size = ((max_offset + 1024*1024 - 1) / (1024*1024)) * 1024*1024; // Round up to nearest MB
        if (flash_size < 4*1024*1024) flash_size = 4*1024*1024; // Minimum 4MB for ESP32 DevKit V1
    } else {
        flash_size = 4 * 1024 * 1024; // Default 4MB for ESP32 DevKit V1
    }
    snprintf(resp, sizeof(resp),
        "{"
        "\"version\":\"%s\","  // Program Version
        "\"build\":\"%s %s\"," // Build Date & Time
        "\"sdk\":\"%s\","      // Core/SDK Version
        "\"restart_reason\":\"%s\"," // Restart Reason
        "\"chip_id\":\"%s\","  // ESP Chip Id
        "\"flash_id\":\"%06lX\"," // Flash Chip Id
        "\"flash_size\":\"%lu KB\""
        "}",
        version_str,  // Use version from version.txt file
        app_desc->date, app_desc->time,
        idf_ver,
        reason_str,
        chip_id,
        (unsigned long)(flash_id & 0xFFFFFF),
        (unsigned long)(flash_size / 1024)
    );
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// OTA Firmware Update Handler
static esp_err_t ota_firmware_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "OTA firmware handler called - Content-Length: %d", req->content_len);
    ESP_LOGI(TAG, "Request method: %d, URI: %s", req->method, req->uri);
    
    // Add CORS headers
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST, OPTIONS");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
    
