JohnDevine/ESP32-MQTT-Template/src/main.c
    // Buffer to attempt to read and discard UART echo. Size of the command sent.
    uint8_t echo_buf[sizeof(template_read_cmd)]; 

    // Main loop to periodically send command and read response from BMS.
    while (1) {
        ESP_LOGD(TAG, "[MAIN LOOP] Start iteration");
        esp_task_wdt_reset();
        
        // Check software watchdog timeout
        ESP_LOGD(TAG, "[MAIN LOOP] Check software watchdog");
        if (watchdog_enabled) {
            TickType_t current_time = xTaskGetTickCount();
            TickType_t elapsed_ms = pdTICKS_TO_MS(current_time - last_successful_publish);
            if (elapsed_ms >= watchdog_timeout_ms) {
                ESP_LOGE(TAG, "Software watchdog timeout! No successful MQTT publish in %lu ms (timeout: %lu ms)", elapsed_ms, watchdog_timeout_ms);
                
                // Debug: Show counter before increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter BEFORE increment: %lu ***", watchdog_reset_counter);
                
                // Increment watchdog reset counter and save to NVS
                watchdog_reset_counter++;
                ESP_LOGE(TAG, "Incrementing watchdog reset counter to: %lu", watchdog_reset_counter);
                
                // Debug: Show counter after increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter AFTER increment: %lu ***", watchdog_reset_counter);
                
                save_watchdog_counter_to_nvs();
                
                // Debug: Verify save by reloading from NVS
                uint32_t verify_counter = 0;
                nvs_handle_t verify_handle;
                esp_err_t verify_err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &verify_handle);
                if (verify_err == ESP_OK) {
                    esp_err_t get_err = nvs_get_u32(verify_handle, NVS_KEY_WATCHDOG_COUNTER, &verify_counter);
                    ESP_LOGE(TAG, "*** DEBUG: Verification read from NVS result: %s, value: %lu ***", 
                             esp_err_to_name(get_err), verify_counter);
                    nvs_close(verify_handle);
                } else {
                    ESP_LOGE(TAG, "*** DEBUG: Failed to open NVS for verification: %s ***", esp_err_to_name(verify_err));
                }
                
                ESP_LOGE(TAG, "Forcing system restart...");
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_restart();
            }
        }
        ESP_LOGD(TAG, "[MAIN LOOP] After software watchdog check");

        mqtt_publish_success = false;
        ESP_LOGD(TAG, "[MAIN LOOP] After reset mqtt_publish_success");

        if (debug_logging) {
            ESP_LOGI(TAG, "Sending '%s' command to device...", "Read Data");
        }
        // PutInputCodeHere: Replace with your actual command sending logic
        send_device_command(template_read_cmd, sizeof(template_read_cmd));
        ESP_LOGD(TAG, "[MAIN LOOP] After send_bms_command");

        int echo_read_len = uart_read_bytes(UART_NUM, echo_buf, sizeof(template_read_cmd), pdMS_TO_TICKS(20));
        ESP_LOGD(TAG, "[MAIN LOOP] After uart_read_bytes for echo");

        if (echo_read_len == sizeof(template_read_cmd)) {
            if (debug_logging) {
                ESP_LOGI(TAG, "Successfully read and discarded %d echo bytes.", echo_read_len);
            }
        } else if (echo_read_len > 0) {
            if (debug_logging) {
                ESP_LOGW(TAG, "Partially read %d echo bytes (expected %d). The rest might be in the main read or device response is very fast.", echo_read_len, (int)sizeof(template_read_cmd));
            }
        } else {
            if (debug_logging) {
                ESP_LOGI(TAG, "No echo read or timeout/error during dedicated echo read attempt (read %d bytes). Main read will handle if echo is present.", echo_read_len);
            }
        }
        ESP_LOGD(TAG, "[MAIN LOOP] After echo read handling");

        read_input_data();
        ESP_LOGD(TAG, "[MAIN LOOP] After read_bms_data");

        if (debug_logging) {
            ESP_LOGI(TAG, "Waiting %ld ms before next BMS read cycle...", sample_interval_ms);
        }
        if (sample_interval_ms > 5000) {
            uint32_t remaining_ms = sample_interval_ms;
            while (remaining_ms > 0) {
                uint32_t chunk_ms = (remaining_ms > 5000) ? 5000 : remaining_ms;
                vTaskDelay(pdMS_TO_TICKS(chunk_ms));
                esp_task_wdt_reset();
                remaining_ms -= chunk_ms;
            }
        } else {
            vTaskDelay(pdMS_TO_TICKS(sample_interval_ms));
        }
        ESP_LOGD(TAG, "[MAIN LOOP] End of iteration, feeding TWDT");
        esp_task_wdt_reset();
    }
}

// Wi-Fi Event Handler
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    printf("[WIFI] Event handler called: base=%s, event_id=%ld\n", event_base, event_id);
    
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        printf("[WIFI] WIFI_EVENT_STA_START - calling esp_wifi_connect()\n");
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        printf("[WIFI] WIFI_EVENT_STA_DISCONNECTED - retry_num=%d\n", wifi_retry_num);
        if (wifi_retry_num < EXAMPLE_ESP_MAXIMUM_RETRY) {
            esp_wifi_connect();
            wifi_retry_num++;
            printf("[WIFI] retry to connect to the AP\n");
        } else {
            printf("[WIFI] connect to the AP fail\n");
            printf("[WIFI] WiFi SSID used: %s\n", wifi_ssid);
            printf("[WIFI] WiFi Password used: %s\n", wifi_pass);
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        printf("[WIFI] IP_EVENT_STA_GOT_IP received!\n");
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        printf("[WIFI] got ip:" IPSTR "\n", IP2STR(&event->ip_info.ip));
        printf("Obtained IP address: " IPSTR "\n", IP2STR(&event->ip_info.ip));
        wifi_retry_num = 0;
        // Start MQTT client once IP is obtained
        printf("[WIFI] About to start MQTT client...\n");
        mqtt_app_start();
        printf("[WIFI] MQTT client start function completed\n");
    } else {
        printf("[WIFI] Unhandled event: base=%s, event_id=%ld\n", event_base, event_id);
    }
    printf("[WIFI] Event handler completed\n");
}

// Wi-Fi Initialization
void wifi_init_sta(void)
{
    // Note: esp_netif_init() and esp_event_loop_create_default() 
    // are already called in main app initialization
    esp_netif_create_default_wifi_sta();

