JohnDevine/ESP32-MQTT-Template/src/main.c
static float get_cpu_temperature(void) {
    // ESP32 temperature reading is complex and requires additional configuration
    // For now, return a placeholder that could be enhanced later
    // Alternative: Use ADC reading from internal temperature sensor or external sensor
    return 25.0 + (esp_random() % 20); // Simulated temperature 25-45°C for demonstration
}

static char* get_software_version(void) {
    static char version_str[16] = "0.0.0"; // Default fallback - indicates version file not read
    static bool version_loaded = false;
    
    if (!version_loaded) {
        ESP_LOGI(TAG, "Attempting to read version from /spiffs/version.txt");
        FILE *version_file = fopen("/spiffs/version.txt", "r");
        if (version_file) {
            ESP_LOGI(TAG, "Version file opened successfully");
            if (fgets(version_str, sizeof(version_str), version_file)) {
                ESP_LOGI(TAG, "Read version string: '%s'", version_str);
                // Remove trailing newline if present
                char *newline = strchr(version_str, '\n');
                if (newline) *newline = '\0';
                char *carriage_return = strchr(version_str, '\r');
                if (carriage_return) *carriage_return = '\0';
                ESP_LOGI(TAG, "Cleaned version string: '%s'", version_str);
            } else {
                ESP_LOGE(TAG, "Failed to read from version file");
            }
            fclose(version_file);
        } else {
            ESP_LOGE(TAG, "Failed to open /spiffs/version.txt - file may not exist or SPIFFS not mounted");
        }
        version_loaded = true;
    }
    return version_str;
}

// Placeholder for publishing BMS data
// This function will be expanded to create and send the two JSON messages
void publish_input_data_mqtt(const input_data_t *input_data_ptr) {
    if (debug_logging) printf("[DEBUG] publish_input_data_mqtt() called\n");
    
    if (!mqtt_client) {
        ESP_LOGE(TAG, "MQTT client not initialized!");
        if (debug_logging) printf("[DEBUG] MQTT client not initialized - returning\n");
        return;
    }

    ESP_LOGI(TAG, "Preparing to publish input data via MQTT...");

    // PutOutputFormattingForMqttHere: Replace this JSON creation with your specific format
    // Create JSON with your specific data structure
    cJSON *root = cJSON_CreateObject();
    if (!root) {
        ESP_LOGE(TAG, "Failed to create cJSON root object.");
        return;
    }

    // Add processor metrics data first (system information)
    cJSON *processor_root = cJSON_CreateObject();
    if (processor_root) {
        // WiFi RSSI as percentage
        int32_t wifi_rssi_percent = get_wifi_rssi_percent();
        cJSON_AddNumberToObject(processor_root, "WiFiRSSI", wifi_rssi_percent);
        
        // IP Address
        char *ip_address = get_ip_address();
        cJSON_AddStringToObject(processor_root, "IPAddress", ip_address);
        
        // CPU Temperature
        float cpu_temp = get_cpu_temperature();
        cJSON_AddNumberToObject(processor_root, "CPUTemperature", cpu_temp);
        
        // Software Version
        char *software_version = get_software_version();
        cJSON_AddStringToObject(processor_root, "SoftwareVersion", software_version);
        
        // Watchdog Restart Count
        cJSON_AddNumberToObject(processor_root, "WDTRestartCount", watchdog_reset_counter);
        
        cJSON_AddItemToObject(root, "processor", processor_root);
    }

    // PutOutputFormattingForMqttHere: Add your specific data formatting here
    // Example: Add your input data to the JSON
    cJSON *data_root = cJSON_CreateObject();
    if (data_root) {
        // Add pack name 
        cJSON_AddStringToObject(data_root, "deviceName", pack_name);
        
        // Example data fields (replace with your actual data structure)
        cJSON_AddNumberToObject(data_root, "exampleVoltage", input_data_ptr->example_voltage);
        cJSON_AddNumberToObject(data_root, "exampleCurrent", input_data_ptr->example_current);
        cJSON_AddNumberToObject(data_root, "examplePercentage", input_data_ptr->example_percentage);
        
        // PutOutputFormattingForMqttHere: Add more fields as needed
        // Examples:
        // cJSON_AddNumberToObject(data_root, "yourField1", input_data_ptr->your_field1);
        // cJSON_AddStringToObject(data_root, "yourField2", input_data_ptr->your_field2);
        // cJSON_AddBoolToObject(data_root, "yourField3", input_data_ptr->your_field3);
        
        cJSON_AddItemToObject(root, "data", data_root);
    }

    // Publish as a single topic
    char *json_string = cJSON_PrintUnformatted(root);
    if (json_string == NULL) {
        ESP_LOGE(TAG, "Failed to print combined cJSON to string.");
    } else {
        char topic[64];
        // Use data_topic directly (you may want to rename this variable for your use case)
        snprintf(topic, sizeof(topic), "%s", data_topic);
        if (debug_logging) printf("[DEBUG] About to publish to topic: %s\n", topic);
        if (debug_logging) printf("[DEBUG] JSON payload length: %d\n", strlen(json_string));
        esp_mqtt_client_publish(mqtt_client, topic, json_string, 0, 1, 0);
        ESP_LOGI(TAG, "Published to %s (length: %d)", topic, strlen(json_string));
        free(json_string);
    }
    cJSON_Delete(root);
}

// Helper to convert hex char to int
int hex2int(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    return 0;
}

// URL decode utility (in-place)
void url_decode(char *dst, const char *src, size_t dstsize) {
    char a, b;
    size_t i = 0, j = 0;
    while (src[i] && j + 1 < dstsize) {
        if (src[i] == '%' && src[i+1] && src[i+2]) {
            if ((a = src[i+1]) && (b = src[i+2])) {
                dst[j++] = hex2int(a) * 16 + hex2int(b);
                i += 3;
            } else {
                dst[j++] = src[i++];
            }
        } else if (src[i] == '+') {
            dst[j++] = ' ';
            i++;
        } else {
            dst[j++] = src[i++];
        }
    }
    dst[j] = '\0';
}

// DNS hijack task for captive portal
void dns_hijack_task(void *pvParameter) {
    // Remove from watchdog to prevent conflicts during configuration mode
    // esp_task_wdt_add(NULL);
    
