JohnDevine/ESP32-MQTT-Template/src/main.c
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "Failed to create DNS socket: errno=%d", errno);
        vTaskDelete(NULL);
        return;
    }
    
    // Set socket options for better reliability
    int reuse = 1;
    if (setsockopt(sock, SOL_SOCKET, SO_REUSEADDR, &reuse, sizeof(reuse)) < 0) {
        ESP_LOGW(TAG, "Failed to set SO_REUSEADDR: errno=%d", errno);
    }
    
    struct sockaddr_in server_addr;
    memset(&server_addr, 0, sizeof(server_addr));
    server_addr.sin_family = AF_INET;
    server_addr.sin_port = htons(53);
    server_addr.sin_addr.s_addr = htonl(INADDR_ANY);
    
    if (bind(sock, (struct sockaddr *)&server_addr, sizeof(server_addr)) < 0) {
        ESP_LOGE(TAG, "Failed to bind DNS socket: errno=%d", errno);
        close(sock);
        vTaskDelete(NULL);
        return;
    }
    
    ESP_LOGI(TAG, "DNS hijack server started on UDP port 53");
    
    uint8_t buf[512];
    struct sockaddr_in client_addr;
    socklen_t addr_len = sizeof(client_addr);
    uint32_t dns_requests_handled = 0;
    
    // Set a more reasonable timeout
    struct timeval timeout;
    timeout.tv_sec = 5;  // Increased to 5 seconds
    timeout.tv_usec = 0;
    if (setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout)) < 0) {
        ESP_LOGW(TAG, "Failed to set socket timeout: errno=%d", errno);
    }
    
    while (!system_shutting_down) {  // Check shutdown flag
        int len = recvfrom(sock, buf, sizeof(buf), 0, (struct sockaddr *)&client_addr, &addr_len);
        
        if (len > 0 && len >= 12) {  // Valid DNS query minimum size
            dns_requests_handled++;
            ESP_LOGD(TAG, "DNS request #%lu received (%d bytes)", dns_requests_handled, len);
            
            // Minimal DNS response: copy ID, set response flags, answer count = 1
            uint8_t response[512];
            memcpy(response, buf, len);
            response[2] = 0x81; // QR=1, Opcode=0, AA=1, TC=0, RD=0
            response[3] = 0x80; // RA=1, Z=0, RCODE=0
            response[7] = 1;    // ANCOUNT = 1
            
            // Copy question section after header (12 bytes)
            int qlen = len - 12;
            if (qlen > 0 && qlen < 400) {  // Sanity check
                memcpy(response + 12, buf + 12, qlen);
                int pos = 12 + qlen;
                
                // Answer: pointer to name (0xC00C), type A, class IN, TTL, RDLENGTH, RDATA
                response[pos++] = 0xC0; response[pos++] = 0x0C;
                response[pos++] = 0x00; response[pos++] = 0x01; // Type A
                response[pos++] = 0x00; response[pos++] = 0x01; // Class IN
                response[pos++] = 0x00; response[pos++] = 0x00; response[pos++] = 0x00; response[pos++] = 0x3C; // TTL 60s
                response[pos++] = 0x00; response[pos++] = 0x04; // RDLENGTH 4
                response[pos++] = 192;  response[pos++] = 168;  response[pos++] = 4; response[pos++] = 1; // 192.168.4.1
                
                int sent = sendto(sock, response, pos, 0, (struct sockaddr *)&client_addr, addr_len);
                if (sent < 0) {
                    ESP_LOGW(TAG, "Failed to send DNS response: errno=%d", errno);
                } else {
                    ESP_LOGD(TAG, "DNS response sent (%d bytes)", sent);
                }
            } else {
                ESP_LOGW(TAG, "Invalid DNS query length: %d", qlen);
            }
        } else if (len < 0) {
            if (errno == EAGAIN || errno == EWOULDBLOCK) {
                // Timeout - this is expected, continue
                ESP_LOGV(TAG, "DNS socket timeout (expected)");
            } else {
                ESP_LOGE(TAG, "DNS socket error: errno=%d", errno);
                break;
            }
        }
        
        // Yield to other tasks periodically
        if (dns_requests_handled % 10 == 0) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
    
    ESP_LOGI(TAG, "DNS hijack task shutting down gracefully (%lu requests handled)", dns_requests_handled);
    close(sock);
    vTaskDelete(NULL);
}

// Test function to manually trigger watchdog reset (for testing only)
void test_watchdog_reset() {
    ESP_LOGI(TAG, "=== TESTING WATCHDOG RESET ===");
    ESP_LOGI(TAG, "Current watchdog_reset_counter: %lu", watchdog_reset_counter);
    
    // Increment watchdog reset counter and save to NVS
    watchdog_reset_counter++;
    ESP_LOGI(TAG, "Incrementing watchdog reset counter to: %lu", watchdog_reset_counter);
    save_watchdog_counter_to_nvs();
    
    ESP_LOGI(TAG, "Test watchdog reset complete. Counter saved to NVS.");
}